Documents/ОплатаЗаПовережденноеИмуществоОбщежития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОплатаЗаПовережденноеИмуществоОбщежития</Name>
			<BasedOn>
				<xr:Item>Catalog.Студенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаПоврежденногоИмущества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СотрудникЗаполняющийДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платильщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Родители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общежитие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Общежития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаСтудентом</Name>
					<Comment>Оплата студентом?</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_ИспорченноеИмущество</Name>
					<Comment>Испорченное Имущество</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Comment>Материал</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Comment>Набор свойств</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОплатаЗаПовережденноеИмуществоОбщежития/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОплатаЗаПовережденноеИмуществоОбщежития.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплатаЗаПовережденноеИмуществоОбщежития.Дата,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.Номер,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.Общежитие,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.СотрудникЗаполняющийДокумент,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.Студент,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.СуммаДокумента,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.ТипОплаты,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.ТЧ_ИспорченноеИмущество.(
	|		НомерСтроки,
	|		Материал,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ОплатаЗаПовережденноеИмуществоОбщежития КАК ОплатаЗаПовережденноеИмуществоОбщежития
	|ГДЕ
	|	ОплатаЗаПовережденноеИмуществоОбщежития.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ИспорченноеИмуществоШапка = Макет.ПолучитьОбласть("ТЧ_ИспорченноеИмуществоШапка");
	ОбластьТЧ_ИспорченноеИмущество = Макет.ПолучитьОбласть("ТЧ_ИспорченноеИмущество");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ИспорченноеИмуществоШапка);
		ВыборкаТЧ_ИспорченноеИмущество = Выборка.ТЧ_ИспорченноеИмущество.Выбрать();
		Пока ВыборкаТЧ_ИспорченноеИмущество.Следующий() Цикл
			ОбластьТЧ_ИспорченноеИмущество.Параметры.Заполнить(ВыборкаТЧ_ИспорченноеИмущество);
			ТабДок.Вывести(ОбластьТЧ_ИспорченноеИмущество, ВыборкаТЧ_ИспорченноеИмущество.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
